experiments/handbooks/guide-for-mysql-zip-archive-installation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh" xml:lang="zh">
<head>
<!-- 2017-11-06 Mon 23:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MySQL ZIP Archive版本安装说明</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="王晓东（Xiaodong Wang）" />
<link rel="stylesheet" type="text/css" href="../orgcss/worg.css" />
</head>
<body>
<div id="content">
<h1 class="title">MySQL ZIP Archive版本安装说明</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7465e00">1. 系统环境</a></li>
<li><a href="#orgf1313b4">2. 软件下载</a></li>
<li><a href="#org41b5c1f">3. 软件安装</a></li>
<li><a href="#orgc7edf4e">4. 数据库系统基本配置</a></li>
<li><a href="#orgbb18dc8">5. 小结</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7465e00" class="outline-2">
<h2 id="org7465e00"><span class="section-number-2">1</span> 系统环境</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt>硬件</dt><dd>Surface Pro 4；</dd>
<dt>操作系统</dt><dd>Windows 10专业版 16299.19 64bit；</dd>
<dt>MySQL</dt><dd>MySQL Community Server 5.7.20，Windows (x86,64bit) ZIP Archive；</dd>
<dt>MySQL安装路径</dt><dd>C:\MySQL，请视自己计算机情况选择安装目录。</dd>
</dl>
</div>
</div>


<div id="outline-container-orgf1313b4" class="outline-2">
<h2 id="orgf1313b4"><span class="section-number-2">2</span> 软件下载</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>MySQL下载地址：<a href="https://dev.mysql.com/downloads/mysql/">https://dev.mysql.com/downloads/mysql/</a></li>
<li>下载版本：Windows (x86, 64-bit), ZIP Archive，mysql-5.7.20-winx64.zip</li>
</ul>
</div>
</div>

<div id="outline-container-org41b5c1f" class="outline-2">
<h2 id="org41b5c1f"><span class="section-number-2">3</span> 软件安装</h2>
<div class="outline-text-2" id="text-3">
<p>
使用管理员权限打开命令提示符，步骤：开始菜单选择Windows系统 - 命令提示符 - 在其上点击右键选择 - 更多 - 以管理员身份运行。
</p>

<p>
定位到C盘根目录，创建MySQL目录。
</p>

<div class="org-src-container">
<pre class="src src-dos">C:\&gt;md MySQL
</pre>
</div>

<p>
将所下载的MySQL软件压缩包mysql-5.7.20-winx64.zip放在MySQL目录下，并使用解压缩工具（WinRAR等）解压缩；cd到解压目录内，新建my.ini文件，并将以下内容拷贝到my.ini文件内。
</p>

<pre class="example">
[mysql]
# 设置mysql客户端默认字符集
default-character-set=utf8 
[mysqld]
#设置3306端口
port = 3306 
# 设置mysql的安装目录
basedir=C:\MySQL\mysql-5.7.20-winx64
# 设置mysql数据库的数据的存放目录
datadir=C:\MySQL\mysql-5.7.20-winx64\data
# 允许最大连接数
max_connections=200
# 服务端使用的字符集默认为8比特编码的latin1字符集
character-set-server=utf8
# 创建新表时将使用的默认存储引擎
default-storage-engine=INNODB
</pre>

<p>
注意：按照自己计算机的MySQL预安装路径合理的配置my.ini文件中的basedir和datadir参数；根据datadir参数的路径设置创建data目录，本机为MySQL安装目录下创建data目录。完成上述操作后，MySQL安装目录结构如下：
</p>

<div class="org-src-container">
<pre class="src src-dos">C:\MySQL\mysql-5.7.20-winx64&gt;dir
 驱动器 C 中的卷是 Local Disk
 卷的序列号是 ACAA-D769

 C:\MySQL\mysql-5.7.20-winx64 的目录

2017/11/06  22:33    &lt;DIR&gt;          .
2017/11/06  22:33    &lt;DIR&gt;          ..
2017/11/06  11:50    &lt;DIR&gt;          bin
2017/09/13  17:48            17,987 COPYING
2017/11/06  22:33    &lt;DIR&gt;          data
2017/11/06  11:50    &lt;DIR&gt;          docs
2017/09/13  20:27    &lt;DIR&gt;          include
2017/11/06  11:50    &lt;DIR&gt;          lib
2017/11/06  18:28               425 my.ini
2017/09/13  17:48             2,478 README
2017/11/06  11:50    &lt;DIR&gt;          share
	       3 个文件         20,890 字节
	       8 个目录 190,125,805,568 可用字节
</pre>
</div>

<p>
定位到解压目录的bin目录下，执行初始化以下命令：
</p>

<div class="org-src-container">
<pre class="src src-dos">C:\MySQL\mysql-5.7.20-winx64&gt;cd bin

C:\MySQL\mysql-5.7.20-winx64\bin&gt;mysqld.exe --initialize

C:\MySQL\mysql-5.7.20-winx64\bin&gt;
</pre>
</div>

<p>
注意：执行初始化命令前需要正确创建data目录并确保该目录为空。
</p>

<p>
执行MySQL服务安装命令：
</p>

<div class="org-src-container">
<pre class="src src-dos">C:\MySQL\mysql-5.7.20-winx64\bin&gt;mysqld.exe -install
Service successfully installed.
</pre>
</div>

<p>
注意：安装成功则给出提示。
</p>

<p>
执行启动MySQL服务命令：
</p>

<div class="org-src-container">
<pre class="src src-dos">C:\MySQL\mysql-5.7.20-winx64\bin&gt;net start mysql
MySQL 服务正在启动 .
MySQL 服务已经启动成功。
</pre>
</div>

<p>
也可以通过在开始菜单上点击右键选择 - 计算机管理 - 服务和应用程序 - 服务，找到MySQL服务，在此完成服务启动及其他配置操作。
</p>

<p>
以下是其他常用的MySQL命令行操作：
</p>

<dl class="org-dl">
<dt>控制台</dt><dd>mysqld &#x2013;console</dd>
<dt>关闭服务器</dt><dd>net stop mysql</dd>
<dt>卸载MySQL</dt><dd>mysqld -remove</dd>
</dl>
</div>
</div>

<div id="outline-container-orgc7edf4e" class="outline-2">
<h2 id="orgc7edf4e"><span class="section-number-2">4</span> 数据库系统基本配置</h2>
<div class="outline-text-2" id="text-4">
<p>
结束所有的MySQL进程，包括mysql.exe和mysqld.exe，可以在任务管理器中结束上述进程。
</p>

<div class="org-src-container">
<pre class="src src-dos">C:\MySQL\mysql-5.7.20-winx64\bin&gt;net stop mysql
MySQL 服务正在停止.
MySQL 服务已成功停止。
</pre>
</div>

<p>
输入mysqld &#x2013;skip-grant-tables，输入后，其他命令行已经无法再输入，需要另打开一个命令行窗口（2号）进行其他操作。
</p>

<div class="org-src-container">
<pre class="src src-dos">C:\MySQL\mysql-5.7.20-winx64\bin&gt;mysqld.exe --skip-grant-tables

</pre>
</div>

<p>
在2号命令行窗口中定位到MySQL安装目录的bin目录下，执行mysql.exe，则无密码登录到MySQL数据库，并输出MySQL命令行操作符。
</p>

<div class="org-src-container">
<pre class="src src-dos">C:\MySQL\mysql-5.7.20-winx64\bin&gt;mysql.exe
Welcome to the MySQL monitor.  Commands end with ; or \g.
Your MySQL connection id is 3
Server version: 5.7.20 MySQL Community Server (GPL)

Copyright (c) 2000, 2017, Oracle and/or its affiliates. All rights reserved.

Oracle is a registered trademark of Oracle Corporation and/or its
affiliates. Other names may be trademarks of their respective
owners.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

mysql&gt;
</pre>
</div>

<p>
进行修改密码操作，MySQL命令行输入以下命令：
</p>

<pre class="example">
mysql&gt; update mysql.user set authentication_string=password('yourpassword') where user='root' and Host ='localhost';
Query OK, 1 row affected, 1 warning (0.01 sec)
Rows matched: 1  Changed: 1  Warnings: 1
</pre>

<p>
其中，yourpassword位置即为所设置的MySQL的超级用户root的初始登录密码，请按需设置。
</p>

<p>
此时再在任务管理器结束所有的MySQL进程，包括mysql.exe和mysqld.exe，重新打开命令提示符（需要管理员权限）或使用Windows服务管理，启动MySQL服务器，即可用新密码登录。
</p>

<p>
MySQL服务启动成功后，在命令行提示符执行mysql.exe -u root -p即可以以刚才修改的root用户登录密码登录MySQL。
</p>

<div class="org-src-container">
<pre class="src src-dos">C:\MySQL\mysql-5.7.20-winx64\bin&gt;mysql.exe -u root -p
Enter password: ************
Welcome to the MySQL monitor.  Commands end with ; or \g.
Your MySQL connection id is 3
Server version: 5.7.20

Copyright (c) 2000, 2017, Oracle and/or its affiliates. All rights reserved.

Oracle is a registered trademark of Oracle Corporation and/or its
affiliates. Other names may be trademarks of their respective
owners.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

mysql&gt;
</pre>
</div>

<p>
接下来，如果在MySQL命令提示符下执行诸如以下操作：
</p>

<div class="org-src-container">
<pre class="src src-dos">mysql&gt; show databases;
ERROR 1820 (HY000): You must reset your password using ALTER USER statement before executing this statement.
mysql&gt; exit
</pre>
</div>

<p>
提示ERROR，必须重新为MySQL用户设置最终的密码，输入exit退出当前MySQL提示符状态。然后，在Windows命令行提示符执行：
</p>

<div class="org-src-container">
<pre class="src src-dos">C:\MySQL\mysql-5.7.20-winx64\bin&gt;mysqladmin -u root -p password
Enter password: ************
New password: ****
Confirm new password: ****
Warning: Since password will be sent to server in plain text, use ssl connection to ensure password safety.
</pre>
</div>

<p>
注意：原样输入以上mysqladmin -u root -p password命令，此处的password不是实际要设置的密码，而是关键字。
</p>

<p>
输入之前密码yourpassword，再输入两次新密码，则root用户密码设置成功。
</p>

<p>
之后，就可以使用新密码登录MySQL数据库了。
</p>
</div>
</div>

<div id="outline-container-orgbb18dc8" class="outline-2">
<h2 id="orgbb18dc8"><span class="section-number-2">5</span> 小结</h2>
<div class="outline-text-2" id="text-5">
<p>
MySQL数据库软件主要核心包含两个部分：
</p>

<dl class="org-dl">
<dt>mysqld.exe</dt><dd>MySQL数据库服务器，以服务的形式注册到Windows系统，可以通过命令行工具net、Windows服务管理窗口管理该服务的启动和停止；如果你要访问数据库资源，必须保证mysqld服务正确启动。</dd>
<dt>mysql.exe</dt><dd>MySQL数据库客户端，属于命令行交互形式的MySQL客户端软件，与其他图形化客户端例如phpmyadmin等功能类似，必须连接本地或远程计算机的mysqld才能发挥作用。</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 王晓东（Xiaodong Wang）</p>
<p class="date">Created: 2017-11-06 Mon 23:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
